** Step 3
:PROPERTIES:
:NOTER_PAGE: (7 . 0.37700282752120645)
:END:
Create an equivalence list. Where we make a list of all lines that are equivalent to their "right" sibling, or to the entry that comes after them.
The idea with step 3 is that anything that is true is a unique example of a line in the file, an equivalency class. Hence why line 0 is blank and every last line of a set is blank.
#+NAME: equivalency-classes
#+BEGIN_SRC elisp :var sorted-hashes=sorted-hashes :results value scalar :session diff
  (defun equivalent? (current rest)
    (if (or (not rest)
            (not
             (string-equal (cadr current) ;; Hash from current
                           (cadr (car rest)))));; Hash from next
        't
      '()))

  (defun find-equivalency-classes (hashed-list)
    (reverse
     (find-equivalency-classes-helper (car hashed-list) (cdr hashed-list) '((0 true)))))

  (defun find-equivalency-classes-helper (current rest collection)
    (if (not current)
        collection
      (find-equivalency-classes-helper (car rest)
                                       (cdr rest)
                                       (cons (list (car current)
                                                   (equivalent? current rest))
                                             collection))))
  (setq equivalency-class
        (find-equivalency-classes sorted-v))
#+END_SRC

#+RESULTS:
: ((0 true) (1 t) (0 nil) (2 t))

